{
    "recipe2": [
        {
            "_id": "1",
            "basic_element": "Chicken",
            "recipe_title": "Grilled chicken with charred pineapple salad",
            "calories": "290",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "30",
            "special_d": "Gluten-free",
            "_elements": "1) 1 teaspoon dried oregano\n2) olive oil\n3) 2 x 150 g free-range chicken breasts\n4) 150 g quinoa\n5) 50 g white cabbage\n6) 1 large handful of salad leaves\n7) ¼ of a pineapple\n8) 50 g natural yoghurt\n9) 1 fresh red chilli\n\nDRESSING:\n1) ½ an avocado\n2) ½ a bunch of fresh coriander, (15g)\n3) 2 tablespoons pickled jalapeños\n4) 2 limes",
            "exec": "1) Combine the oregano in a bowl with 1 to 2 tablespoons of oil, then season with sea salt and black pepper.\n2) Use a sharp knife to slice into the chicken breasts, then open each one out flat like a book to butterfly. Place in the bowl with the herby oil, turning until well coated, then leave to one side.\n3) Cook the quinoa according to the packet instructions, then drain and set aside.\n4) For the dressing, peel and destone the avocado half, then scoop the flesh into a blender. Add half the coriander (stalks and all) and the jalapeños, along with a splash of the pickling liquid and the juice of 1½ limes. Blitz until smooth, adding a splash of oil, if needed. Stir through the quinoa.\n5) Finely shred the cabbage, pick the remaining coriander leaves, then toss with the salad leaves.Place a griddle pan over a high heat. Peel the pineapple, remove and discard any core, then chop into 4.\n6) Place on the hot griddle pan for a few minutes on each side, or until charred, and transfer to a chopping board.\n7) In the same pan, griddle the chicken for 5 minutes on each side, or until charred and cooked through, then remove from the pan and leave to rest on the board for a few minutes.\n8) Chop the griddled pineapple into bite-sized chunks, then slice the chicken into thin strips. Deseed and finely chop the chilli.\n9) Divide the yoghurt between four plates, then top with the chicken, adding the pineapple on one side and the dressed quinoa on the other. Toss the leaves and cabbage with the juice of the remaining lime half and a little salt and pepper, plus the chopped chilli. Divide between the plates, then serve.",
            "img": "@drawable/id_1"
        },
        {
            "_id": "2",
            "basic_element": "Chicken",
            "recipe_title": "Thai green chicken curry",
            "calories": "285",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "50",
            "special_d": "Dairy-free",
            "_elements": "1) 750 g skinless free-range chicken thighs\n2) groundnut oil\n3) 400 g mixed oriental mushrooms\n4) 1 x 400g tin of light coconut milk\n5) 1 organic chicken stock cube\n6) 6 kaffir lime leaves\n7) 200 g mangetout\n8) ½ a bunch fresh Thai basil\n9) 2 limes\n\nCURRY PASTE:\n1) 4 cloves of garlic\n2) 2 shallots\n3) 5cm piece of ginger\n4) 2 lemongrass stalks\n5) 4 green Bird's eye chillies\n6) 1 teaspoon ground cumin\n7)½ a bunch of fresh coriander\n8) 2 tablespoons fish sauce",
            "exec": "1) To make the curry paste, peel, roughly chop and place the garlic, shallots and ginger into a food processor.\n2) Trim the lemongrass, remove the tough outer leaves, then finely chop and add to the processor. Trim and add the chillies along with the cumin and half the coriander (stalks and all). Blitz until finely chopped, add the fish sauce and blitz again.\n3) Slice the chicken into 2.5cm strips. Heat 1 tablespoon of oil in a large pan on a medium heat, add the chicken and fry for 5 to 7 minutes, or until just turning golden, then transfer to a plate.\n4) Tear the mushrooms into even pieces. Return the pan to a medium heat, add the mushrooms and fry for 4 to 5 minutes, or until golden. Transfer to a plate using a slotted spoon.\n5) Reduce the heat to medium-low and add the Thai green paste for 4 to 5 minutes, stirring occasionally.\n6) Pour in the coconut milk and 200ml of boiling water, crumble in the stock cube and add the lime leaves. Turn the heat up and bring gently to the boil, then simmer for 10 minutes, or until reduced slightly.\n7) Stir in the chicken and mushrooms, reduce the heat to low and cook for a further 5 minutes, or until the chicken is cooked through, adding the mangetout for the final 2 minutes.\n8) Season carefully to taste with sea salt and freshly ground black pepper. Pick, roughly chop and stir through the basil leaves and remaining coriander leaves. Serve with lime wedges and steamed rice.",
            "img": "@drawable/id_2"
        },
        {
            "_id": "3",
            "basic_element": "Chicken",
            "recipe_title": "Crispy garlicky chicken",
            "calories": "366",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "20",
            "special_d": "Dairy-free",
            "_elements": "1) 2 x 120 g free-range skinless chicken breasts\n2) 2 thick slices of seeded wholemeal bread , (75g each)\n3) 1 clove of garlic\n4) 1 lemon\n5) 50 g rocket",
            "exec": "1) Place the chicken breasts between two large sheets of greaseproof paper, and whack with the base of a large non-stick frying pan to flatten them to about 1cm thick.\n2) Tear the bread into a food processor, then peel, chop and add the garlic, and blitz into fairly fine crumbs.\n3) Pour the crumbs over the chicken, roughly pat on to each side, then re-cover with the paper and whack again, to hammer the crumbs into the chicken and flatten them further.\n4) Put the pan on a medium heat. Fry the crumbed chicken in 1 tablespoon of olive oil for 3 minutes on each side, or until crisp, golden and cooked through.\n5) Slice, plate up, season to perfection with sea salt and black pepper, sprinkle with lemon-dressed rocket, and serve with lemon wedges, for squeezing over.",
            "img": "@drawable/id_3"
        },
        {
            "_id": "4",
            "basic_element": "Chicken",
            "recipe_title": "Chicken in milk",
            "calories": "443",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "100",
            "special_d": "Gluten-free",
            "_elements": "1) 1 x 1.8 kg whole free-range chicken\n2) 1 teaspoon fennel seeds\n3) 200 g unsalted butter\n4) 1 bulb of garlic\n5) 2 onions\n6) 2 bulbs of fennel\n7) 1 lemon\n8) 1 large bunch of fresh sage (30g) , mixed-colour, if possible\n9) 1- inch stick of cinnamon\n10) 1–1.5 litres whole milk",
            "exec": "1) First up, if you’re jointing the chicken yourself, break the knuckles and chop them off with a sharp knife, through the joint.\n2) Pull out the wings and cut them off at the base, cutting slightly into the breast so you get a generous meaty portion. Lightly cut through the skin between the chicken leg and breast, so that the leg falls to the side.\n3) Bend the leg backwards to disjoint it, and turn breast-side down. Cut between the leg and breast, removing the whole leg, then repeat.\n4) Find the joint in between the drumstick and thigh, tap the heel of the knife and cut through the bone, separating the drumstick and thigh, then repeat.\n5) Leaving the breasts on the bone, carefully cut between the breasts and backbone to separate the front and back of the bird.\n6) Slice between the breasts on the bone to separate, then use the heel of the knife to cut across each breast through the bone, leaving you with two large chunks, then slice each chunk into four pieces. Season the chicken with sea salt, black pepper and 1 teaspoon of fennel seeds. Pop the carcass in a bag and put in the freezer for tasty cooking another day – it makes an amazing stock.\n7) Put a large non-stick pan on a medium-high heat with 50g of butter. Add the chicken wings, legs and thighs skin-side down to brown in the pan for around 3½ minutes, or until golden all over, turning occasionally. Once the butter is dark brown and almost burnt, transfer the chicken to a plate and throw away the oil and butter left in the pan. This will leave you with tasty sticky goodness at the bottom of the pan, which will give you a lovely caramelly flavour later on.\n8) Return your chicken to the pan with another 50g of butter, and repeat the process, turning the chicken for another 3½ minutes, or until the butter is dark brown, then throwing away the almost burnt butter.\n9) Go in with the breast meat and another 50g of butter, and return the browned meat to the pan for a final time along with the bulb of garlic, turning the meat occasionally to get an even golden colour.\n10) Meanwhile, peel, quarter and add the onion. Finely slice the fennel stalks, stopping when you hit the bulb, finely slice the leafy tops, and cut the bulb into quarters, adding to the pan as you go.\n11) Scrape up any sticky bits from the bottom of the pan, then make a well in the middle and add the final 50g of butter.\n12) Use a speed-peeler to peel big chunks of lemon zest into the butter, pick in a large handful of sage leaves and add the cinnamon stick. Fry for a couple of minutes, or until the veg is softened, stirring occasionally.\n13) Pour in around 1 litre of milk (half of the chicken should be submerged) and scrape up all the lovely sticky bits. Squeeze in the lemon juice. The lemon zest will sort of split the milk, making a sauce which is absolutely fantastic. Reduce the heat, cover with a cartouche (greaseproof-paper disc) and simmer for 50 minutes, removing for the final 20 minutes. Taste and check the seasoning and remove the cinnamon stick.\n14) To serve, pull the meat off the bones and divide between plates. Spoon over plenty of juice and the little curds. Delicious served with Parmesan polenta and lemony greens.",
            "img": "@drawable/id_4"
        },
        {
            "_id": "5",
            "basic_element": "Chicken",
            "recipe_title": "Korean-style roast chicken",
            "calories": "810",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "105",
            "special_d": "Dairy-free",
            "_elements": "1) 3 tablespoons of sesame seeds\n2) 250 g kimchi\n3) 2 tablespoons gochujang paste\n4) 2 tablespoons low-salt soy sauce\n5) 2 tablespoons rice vinegar\n6) 1.4 kg whole free-range chicken\n7) 2 tablespoons runny honey\n\nBUNS:\n1) sesame oil\n2) 1 x 400 g tin of light coconut milk\n3) 2 coconut milk tins’ worth of self-raising flour , (500g), plus extra for dusting\n\nSLAW:\n1) 2 carrots\n2) 4 spring onions\n3) 2 fresh red chillies\n4) 1 bok choi\n5) ½ a Chinese cabbage\n6) 2 limes\n7) 1 teaspoon sesame oil\n8) ½ a teaspoon gochugaru , (Korean red pepper powder)",
            "exec": "1) Preheat the oven to 180°C/350°F/gas 4.\n2) Toast the sesame seeds in a dry frying pan for 3 to 5 minutes, or until golden and nutty.\n3) Put the kimchi, gochujang, soy sauce, rice vinegar and 2 tablespoons of the sesame seeds into a blender, and whiz until smooth.\n4) Place the chicken in a snug-fitting baking tray. Pour one third of the marinade over the chicken and rub it in to all the nooks and crannies. Roast for 1 hour 20 minutes, or until everything is gnarly and cooked through.\n5) Add the honey to the remaining marinade and blitz until combined. Pour half into a small bowl and set aside – this will be your dipping sauce. Keep the rest of the sauce for your glaze.\n6) For the buns, cut out 12 x 8cm squares of greaseproof paper and rub each one with a little sesame oil to stop the buns sticking. Pour the coconut milk into a large mixing bowl, then add the flour and a good pinch of sea salt. Start mixing with a fork then get in there with your hands and knead until you have a soft, smooth dough – or do all this in a food processor.\n7) Tip the dough onto a flour-dusted work surface and roll into a sausage shape. Quarter it, then cut each piece into three to make 12 even-sized pieces and roll each into a ball. One-by-one, with a rolling pin, roll the balls into 10cm x 12cm ovals. Lay an oiled chopstick across the middle like a hinge, fold the dough in half and pull the chopstick out. Place each bun on a little rectangle of greaseproof paper ready for steaming.\n8) Remove the chicken from the oven and turn it off. Spoon over the reserved glaze to create another sticky layer and sprinkle over the remaining sesame seeds. Transfer to a plate and return to the oven to keep warm and tighten up the glaze while you cook the buns.\n9) Working in batches, place the buns on their greaseproof squares into a large bamboo steamer and pop the lid on. Place the steamer over a large frying pan or wok filled with 300ml of boiling water and steam for 8 to 10 minutes, or until fluffy and cooked through.\n10) For the slaw, scrub the carrots, trim the spring onions and chillies (deseed if you like), bok choi and cabbage. Finely zest and juice the limes into a serving bowl, add a little sesame oil and a good pinch of gochugaru. Finely chop all the slaw ingredients, drop them into the dressing bowl and toss with your hands to dress.\n11) Shred the chicken and serve with the coconut buns, slaw and remaining sauce.",
            "img": "@drawable/id_5"
        },
        {
            "_id": "6",
            "basic_element": "Pasta",
            "recipe_title": "Spaghetti carbonara",
            "calories": "860",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "1",
            "exec_time": "10",
            "special_d": "None",
            "_elements": "1) 3 large free-range egg yolks\n2) 40 g Parmesan cheese , plus extra to serve\n3) 1 x 150 g piece of higher-welfare pancetta\n4) 200 g dried spaghetti\n5) 1 clove of garlic\n6) extra virgin olive oil",
            "exec": "1) Put the egg yolks into a bowl, finely grate in the Parmesan, season with pepper, then mix well with a fork and put to one side.\n2) Cut any hard skin off the pancetta and set aside, then chop the meat.\n3) Cook the spaghetti in a large pan of boiling salted water until al dente.\n4) Meanwhile, rub the pancetta skin, if you have any, all over the base of a medium frying pan (this will add fantastic flavour, or use 1 tablespoon of oil instead), then place over a medium-high heat.\n5) Peel the garlic, then crush with the palm of your hand, add it to the pan and leave it to flavour the fat for 1 minute. Stir in the pancetta, then cook for 4 minutes, or until it starts to crisp up.\n6) Pick out and discard the garlic from the pan, then, reserving some of the cooking water, drain and add the spaghetti. Toss well over the heat so it really soaks up all that lovely flavour, then remove the pan from the heat.\n7) Add a splash of the cooking water and toss well, season with pepper, then pour in the egg mixture – the pan will help to cook the egg gently, rather than scrambling it. Toss well, adding more cooking water until it’s lovely and glossy.\n8) Serve with a grating of Parmesan and an extra twist of pepper.",
            "img": "@drawable/id_6"
        },
        {
            "_id": "7",
            "basic_element": "Pasta",
            "recipe_title": "Creamy prawn linguine",
            "calories": "514",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "15",
            "special_d": "None",
            "_elements": "1) 150 g dried linguine\n2) 2 cloves of garlic\n3) 160 g raw peeled king prawns , from sustainable sources\n4) 4 rashers of higher-welfare smoked pancetta\n5) olive oil\n6) 50 ml Italian red wine\n7) 1 heaped tablespoon mascarpone cheese\n8) 50 g rocket\n9) 10 g Parmesan cheese",
            "exec": "1) Cook the pasta in a pan of boiling salted water according to the packet instructions. Meanwhile, peel and finely slice the garlic. Run your knife down the back of 2 prawns, so they'll butterfly as they cook, then finely chop the rest.\n2) Put a large non-stick frying pan on a medium heat. Finely slice the pancetta, sprinkle into the pan with 1 tablespoon of olive oil and fry until lightly golden. Toss in the garlic and whole prawns for 2 minutes, then go in with the wine and let it cook away. Toss through the chopped prawns and mascarpone for 1 minute, then use tongs to drag the pasta straight into the pan, letting a little starchy cooking water go with it. Roughly chop the rocket, add most of it to the pan and toss it all together over the heat until you have a silky sauce. Subtly season to perfection with the Parmesan and black pepper. Serve sprinkled with the remaining rocket and an extra grating of Parmesan, if you like.",
            "img": "@drawable/id_7"
        },
        {
            "_id": "8",
            "basic_element": "Pasta",
            "recipe_title": "Honeymoon spaghetti",
            "calories": "476",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "10",
            "special_d": "None",
            "_elements": "1) 1 x 1.5 kg crab or lobster\n2) 30 g unsalted butter\n3) olive oil\n4) 2 cloves of garlic\n5) 1 fresh red chilli\n6) 450 g mussels\n7) 100 g squid\n8) 200 g raw shell-off tiger prawns or small prawns\n9) 450 g dried spaghetti\n10) 1 bunch of flat-leaf parsley , (30g)\n11) 1 bunch of marjoram , (30g)\n12) 1 large free-range egg\n\nSAUCE:\n1) 3 cloves of garlic\n2) 1 fresh red chilli\n3) olive oil\n4) 2 x 400 g tins of quality plum tomatoes",
            "exec": "1) Preheat the oven to 180°C/350°F/gas 4. Plunge the crab or lobster into boiling water and boil for 15 minutes, then remove. Once cooled, remove all the meat from the shell, flaking it up into small pieces, and removing any splinters.\n2) To make the sauce, pound up the shells using a rolling pin and finely chop the garlic and chilli. Drizzle 1 tablespoon of olive oil into a saucepan over a medium heat and fry the garlic and chilli with the empty shell and legs. Add the tomatoes, breaking them up with a wooden spoon, and a large glass of water and simmer for 1 hour. Pass through a sieve, discarding the shells and season to perfection with sea salt and black pepper.\n3) Cook the spaghetti in boiling salted water according to the packet instructions until al dente then drain.\n4) Melt the butter and 1 tablespoon of oil in a large pan over a medium heat. Finely slice the garlic and chilli, then add them to the pan and gently fry. Scrub and debeard the mussels and slice the squid. Turn up the heat, add the mussels prawns and cook for 2 minutes. Remove from the heat, discarding any unopened mussels.\n5) Add the tomato sauce, cooked pasta and crab or lobster meat. Pick the parsley and marjoram leaves and finely chop, then add them to the pan and mix everything together.\n6) Fold a 60cm x 120cm piece of greaseproof in half to get a crease and open it out again on a baking tray. Place the seafood mixture in the centre of one half. Beat the egg, then use it to brush all the edges. Bring the two sides together and seal well. Cook for 10 minutes, or until puffed up.",
            "img": "@drawable/id_8"
        },
        {
            "_id": "9",
            "basic_element": "Pasta",
            "recipe_title": "Broccoli & anchovy orecchiette",
            "calories": "367",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "20",
            "_elements": "1) 2 large heads of broccoli\n2) 2 large cloves of garlic\n3)8 anchovy fillets , in oil, from sustainable sources\n4) 4 good knobs of butter\n5) 2-4 small dried red chillies , to taste\n6) 450 g dried orecchiette\n7) Parmesan cheese",
            "exec": "Using a small knife, trim round the broccoli to remove the dark green florets from the main stalks and put them to one side. Peel the stalks, trim off the dry end and throw this away. Peel and chop the garlic.|Finely chop the broccoli stalk and put into a large pan with the garlic, anchovies and half the butter. Crumble in the chilli, cover with a lid and cook slowly for 8 to 10 minutes while you cook the pasta in boiling salted water according to the packet instructions.|Something I like to do which is slightly different (but better, I’d like to think) is to cook the broccoli florets with the pasta for the last 4 minutes – this makes them soft enough to eat but leaves them with great colour and texture.|Drain the pasta and broccoli, saving a little of the cooking water, then toss into the other pan. Remove the pan from the heat.|Season to taste with sea salt, black pepper, the rest of the butter and finely grate in a large handful of Parmesan. Mix well, adding a little of the cooking water, to loosen, if needed, and make it shine.|Serve immediately, sprinkling with another good handful of finely grated Parmesan.",
            "img": "@drawable/id_9"
        },
        {
            "_id": "10",
            "basic_element": "Pasta",
            "recipe_title": "Asparagus linguine",
            "calories": "407",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "15",
            "special_d": "Vegeterian",
            "_elements": "1) 300 g dried linguine\n2) 300 g mixed asparagus , (wild, white, regular)\n3) 4 cloves of garlic\n4) 2 dried red chillies\n5) olive oil\n6) 1 knob of unsalted butter\n7) 30 g pecorino , or Parmesan cheese, plus extra to serve\n8) 1 lemon",
            "exec": "1) Cook the pasta in a pan of boiling salted water according to the packet instructions.\n2) Meanwhile, snap off and discard the woody ends of the asparagus, then finely slice the spears at an angle, leaving the tips whole.\n3) Peel and finely slice the garlic, crumble up the dried chillies, and place both in a large frying pan on a medium heat with 2 tablespoons of oil and the butter. When the garlic starts to sizzle, stir in the asparagus. Let it start to fry, then add a spoonful of pasta water, cover, and leave to simmer on a low heat until the pasta is al dente.\n4) Using tongs, drag the pasta straight into the asparagus pan, letting a little starchy cooking water go with it. Turn the heat off, then finely grate in the pecorino and toss together until the fat, cheese and liquid make a natural creamy sauce – loosen with a little extra cooking water, if needed.\n5) Taste and season to perfection, then divide between your plates. Finish with a grating of pecorino and a little lemon zest, to taste.",
            "img": "@drawable/id_10"
        },
        {
            "_id": "11",
            "basic_element": "Fruit",
            "recipe_title": "Mixed leaf salad with mozzarella, mint, peach & prosciutto",
            "calories": "412",
            "date_added": "14/5/2021",
            "recipe_category": "Salad",
            "dif_rate": "2",
            "exec_time": "10",
            "special_d": "None",
            "_elements": "1) ripe peach\n2) buffalo mozzarella\n3) higher-welfare prosciutto\n4) fresh mint\n5) mixed salad leaves\n6) extra virgin olive oil\n7) lemon\n8) dried red chilli , optional",
            "exec": "1) If I make this for my lunch I’ll use one nice, ripe peach, half a ball of mozzarella and a couple of slices of prosciutto.\n2) Pinch the skin of the peaches and peel from the bottom to the top, then quarter.\n3) Rip the mozzarella into small pieces and place on a plate with the peaches. Lightly season with sea salt and black pepper.\n4) Lay a couple of slices of prosciutto over the top.\n5) Tear up the mint leaves, toss with the mixed salad leaves and dress with a little of the extra virgin olive oil & lemon juice dressing.\n6) Throw the leaves on top. Simple!",
            "img": "@drawable/id_11"
        },
        {
            "_id": "12",
            "basic_element": "Potato",
            "recipe_title": "Smoked trout, horseradish & new potato salad",
            "calories": "449",
            "date_added": "14/5/2021",
            "recipe_category": "Salad",
            "dif_rate": "2",
            "exec_time": "20",
            "special_d": "None",
            "_elements": "1) 800 g new potatoes\n2) 4 tablespoons crème fraîche , or soured cream\n3) 2 lemons\n4) extra virgin olive oil\n5) 4 heaped tablespoons fresh horseradish , or jarred horseradish\n6) 1 bunch of fresh flat-leaf parsley , (30g)\n7) ½ a bunch of fresh chives\n8) 1 small bunch of spring onions\n9) 300 g hot-smoked trout , from sustainable sources",
            "exec": "1) Scrub the potatoes and cook them in boiling salted water until tender, then drain.\n2) While still warm, but cool enough to handle, either cut the potatoes in half or squash them into a large salad bowl.\n3) Add the crème fraîche, the zest and juice of 1 lemon and 4 tablespoons of oil. Toss around, then season to taste with sea salt and black pepper.\n4) Add or finely grate in the horseradish, tasting as you go, then finely chop the parsley and chives and throw these into the bowl.\n5) Trim, finely slice and add the spring onions, tear in the smoked trout, and mix together.\n6) Now it’s very important to balance your salad with more seasoning and maybe an extra squeeze of lemon juice. You may even want to give it more of a kick by adding some extra horseradish. Personally, I love to add a lot of horseradish and make it really hot.\n7) Great served as a starter, salad or even dinner if you love it as much as I do.",
            "img": "@drawable/id_12"
        },
        {
            "_id": "13",
            "basic_element": "Squash",
            "recipe_title": "Harissa squash salad",
            "calories": "361",
            "date_added": "14/5/2021",
            "recipe_category": "Salad",
            "dif_rate": "2",
            "exec_time": "60",
            "special_d": "None",
            "_elements": "1) 1 butternut squash , (1.2kg)\n2) 1 heaped tablespoon rose harissa\n3) 2 ripe avocados\n4) 100 g mixed salad leaves\n5) 1 x 125 g ball of mozzarella cheese",
            "exec": "1) Preheat the oven to 180ºC/350ºF/gas 4.Carefully cut the squash into rough 5cm chunks (seeds and all). Then, in a roasting tray, rub all over with the harissa, 1 tablespoon of olive oil and a pinch of sea salt and black pepper.\n2) Roast for 50 minutes, or until soft, golden and gnarly. With a few minutes to go, place 1 tablespoon each of extra virgin olive oil and red wine vinegar, and a little salt and pepper, in a large bowl.\n3) Halve, peel, destone, slice and toss in the avocados, then gently mix in the salad leaves. Use forks to divide and tear the hot squash (skin, seeds and all) between your plates. Divide up the salad on top and tear over the mozzarella, then serve.",
            "img": "@drawable/id_13"
        },
        {
            "_id": "14",
            "basic_element": "Salmon",
            "recipe_title": "Sorta salmon niçoise",
            "calories": "398",
            "date_added": "14/5/2021",
            "recipe_category": "Salad",
            "dif_rate": "2",
            "exec_time": "18",
            "special_d": "None",
            "_elements": "1) 2 x 120 g salmon fillets , skin on, scaled, pin-boned, from sustainable sources\n2) 300 g green beans\n3) 2 large free-range eggs\n4) 8 black olives , (stone in)\n5) 2 heaped tablespoons Greek yoghurt",
            "exec": "1) Place the salmon skin side down in a colander over a pan of boiling salted water, covered, to steam for 8 minutes.\n2) Line up the beans, trim off just the stalk end, then boil in the water under the salmon for 6 minutes, or until just cooked but not squeaky. Gently lower in the eggs to cook for exactly 5½ minutes, alongside.\n3) Meanwhile, squash the olives and remove the stones, then finely chop the flesh. Mix half of the olives through the yoghurt with a splash of red wine vinegar, taste and season to perfection with sea salt and black pepper.\n4) Remove the salmon to a board, then drain the eggs and beans in the colander.\n5) Toss the beans in the dressing and divide between your plates. Refresh the eggs under cold water until cool enough to handle, then peel and cut into quarters.\n6) Flake over the salmon, discarding the skin, arrange the eggs on top and dot over the remaining chopped olives.\n7) Finish with 1 teaspoon of extra virgin olive oil and a good pinch of pepper, from a height.",
            "img": "@drawable/id_14"
        },
        {
            "_id": "15",
            "basic_element": "Beans",
            "recipe_title": "Italian spring bean salad",
            "calories": "328",
            "date_added": "14/5/2021",
            "recipe_category": "Salad",
            "dif_rate": "2",
            "exec_time": "60",
            "special_d": "Vegetarian",
            "_elements": "1) 1 stick of celery , (60g)\n2) ½ a carrot, (60g)\n3) 120 g radicchio\n4) 10 g fresh basil\n5) 1½ x 400 g tin of beans, such as borlotti or kidney\n6) 1 tablespoon chopped onion\n7) 130 ml extra virgin olive oil\n8) 80 ml white wine vinegar\n9) 75 g Parmesan rinds , (about 3)\n10) 100 g stale bread",
            "exec": "1) Trim the celery, peel and trim the carrot, then cut, along with the radicchio, into 5mm cubes. Pick and finely chop the basil leaves.\n2) Drain and rinse the beans and place in a bowl (save the remainder for another dish) with the radicchio, celery, carrot, onion and basil. Stir in the olive oil and vinegar, then season and leave to rest for 2 hours at room temperature.\n3) Meanwhile, place the Parmesan rinds in a pot with 1.5 litres of cold water and cook slowly over a low–medium for 1 hour. Remove from the heat and leave the rinds in the water to cool.\n4) Preheat the oven to 200ºC/400ºF/gas 6.\n5) Cut the bread into 1cm cubes, scatter over a baking tray and toast in the oven until golden, about 20 minutes, tossing halfway through.\n6) Divide the bean mixture between plates, then add a few tablespoons of the cooled parmesan broth. Garnish with croutons and the Parmesan rinds, finely sliced with a speed-peeler, if you like.",
            "img": "@drawable/id_15"
        },
        {
            "_id": "16",
            "basic_element": "Fruit",
            "recipe_title": "Frozen fruit & almond crumble",
            "calories": "252",
            "date_added": "14/5/2021",
            "recipe_category": "Desert",
            "dif_rate": "2",
            "exec_time": "45",
            "special_d": "Vegetarian",
            "_elements": "1) 1 kg mixed frozen berries and cherries\n2) 100 g sugar½ an orange\n3) 50 g unsalted butter, (cold)\n4) 100 g plain flour\n5) 100 g flaked almonds",
            "exec": "1) Preheat the oven to 200°C/400°F/gas 6. Tip the frozen berries into a saucepan with half the sugar and place on a medium heat.\n2) Squeeze in the juice of half an orange and cook for 5 to 8 minutes, or until the sugar has dissolved and the fruit has softened. Remove from the heat and leave to cool a little.\n3) Meanwhile, cube the butter and place in a mixing bowl with the flour. Rub together with your fingertips until it resembles breadcrumbs, then stir in the almonds and remaining sugar.\n4) Transfer the berry mixture to a 25cm x 30cm baking dish and sprinkle over the crumble topping.\n5) Bake in the oven for 25 to 30 minutes, or until golden and crunchy. Delicious served with vanilla ice cream.",
            "img": "@drawable/id_16"
        },
        {
            "_id": "17",
            "basic_element": "Chocolate",
            "recipe_title": "Chocolate & banana French toast",
            "calories": "518",
            "date_added": "14/5/2021",
            "recipe_category": "Desert",
            "dif_rate": "2",
            "exec_time": "15",
            "special_d": "Vegetarian",
            "_elements": "1) 2 bananas\n2) 2 large free-range eggs\n3) ½ a teaspoon vanilla extract\n4) 1 pinch of ground cinnamon\n5) 2 slices of white bread\n6) 25 g blanched hazelnuts\n7) a small knob of unsalted butter , or olive oil\n8) 40 g dark chocolate , (minimum 70% solids)\n9) 2 teaspoons icing sugar\n10) 2 tablespoons Greek-style yoghurt , to serve",
            "exec": "1) Peel and slice the banana in half lengthways and set aside. Crack the eggs into a shallow bowl, add the vanilla and cinnamon then whisk together with a fork.\n2) Soak the bread slices in the egg mixture for a couple of minutes, turning halfway.\n3) Place a large dry frying pan on a medium heat and toast the hazelnuts until golden, then tip into a pestle and mortar and bash until fine.\n4) Return the pan to the heat with the butter (or 1 teaspoon of oil). Once hot, carefully place one egg-soaked slice into the pan and break over the chocolate. Place the remaining slice on top and sandwich together.\n5) Add the banana slices to the pan and cook, without moving, for 2 minutes, until lightly golden.\r\nUse a spatula to carefully flip the bread and banana slices and cook for a further 2 minutes, until light golden on both sides.\n6) Lightly dust the top of the sandwich with the icing sugar and flip back over for a few seconds to caramelise.\n7) Carefully slide the sandwich onto a board (the caramel will be very hot!), cut in half diagonally, then transfer to a plate.\n8) To serve, place half a sandwich on each plate, top with 2 pieces of caramelised banana and a dollop of yoghurt, and finish with a good dusting of crushed hazelnuts.",
            "img": "@drawable/id_17"
        },
        {
            "_id": "18",
            "basic_element": "Chocolate",
            "recipe_title": "Chocolate tart",
            "calories": "436",
            "date_added": "14/5/2021",
            "recipe_category": "Desert",
            "dif_rate": "2",
            "exec_time": "120",
            "special_d": "Vegetarian",
            "_elements": "1) 300 ml double cream\n2) 2 level tablespoons caster sugar\n3) 400 g quality dark chocolate , (70%)\n4) 90 g unsalted butter , at room temperature\n5) 100 ml milk\n6) 1 tart shell , baked blind\n7) quality cocoa powder , for dusting",
            "exec": "1) Place the double cream, sugar and a tiny pinch of sea salt in a pan and bring to the boil.\n2) Break up the chocolate.\n3) As soon as the mixture has boiled, remove from the heat and add the butter and chocolate. Stir until it has completely melted. Allow the mixture to cool slightly, stirring in the cold milk until smooth and shiny.\n4) Sometimes this mixture looks like it has split. Allow to cool down a bit more and whisk in a little extra cold milk until smooth.\n5) Scrape all the mixture into the cooked and cooled pastry shell with a spatula.\n6) Shake the tart to even it out and allow to cool for around 1 to 2 hours until it is at room temperature. Dust with the cocoa powder.\n7) Ultimately the pastry should be short and crisp and the filling should be smooth and should cut like butter.",
            "img": "@drawable/id_18"
        },
        {
            "_id": "19",
            "basic_element": "Chocolate",
            "recipe_title": "Chocolate brownie",
            "calories": "438",
            "date_added": "14/5/2021",
            "recipe_category": "Desert",
            "dif_rate": "2",
            "exec_time": "50",
            "special_d": "Vegetarian",
            "_elements": "1) 250 g quality dark chocolate (70%)\n2) 250 g unsalted butter\n3) 4 large free-range eggs\n4) 250 g golden caster sugar\n5) 2 heaped tablespoons self-raising flour\n6) 2 heaped tablespoons quality cocoa powder",
            "exec": "1) Preheat the oven to 180ºC/350ºF/gas 4.\n2) Tear off a large piece of greaseproof paper, scrunch it up under cold water, then unfold and use it to line a 20cm square baking tin.\n3) Snap the chocolate into a heatproof bowl, dice the butter and add with a pinch of sea salt. Melt over a pan of gently simmering water, stirring regularly, then remove from the heat and leave to cool slightly.\n4) Crack the eggs into a large bowl, then add the sugar and whisk until light, pale and fluffy.\n5) Sieve in the flour, followed by the cocoa. Whisk to combine, then fold through the melted chocolate.\n6) Spoon the mixture into the lined tin and spread it out evenly. Bake for 25 to 30 minutes, or until crisp on the outside but slightly wobbly.\n7) Leave to cool in the tin for 15 minutes before slicing and serving warm – delicious with vanilla ice cream, crushed hazelnuts and caramel popcorn.",
            "img": "@drawable/id_19"
        },
        {
            "_id": "20",
            "basic_element": "Cranberry",
            "recipe_title": "Frozen cranberry cranachan",
            "calories": "435",
            "date_added": "14/5/2021",
            "recipe_category": "Desert",
            "dif_rate": "2",
            "exec_time": "60",
            "special_d": "Vegetarian",
            "_elements": "1) 300 g pack of frozen cranberries\n2) 150 g frozen raspberries\n3) 4 tablespoons caster sugar\n4) 6 tablespoons Drambuie\n\nOATMEAL CRUNCH:\n1) coconut oil , or olive oil, for greasing\n2) 75 g medium oats\n3) 125 g caster sugar\n\nFROZEN CREAM:\n1) 4 medium free-range egg yolks , (at room temperature)\n2) 2 tablespoons caster sugar\n3) 100 g clear wildflower honey\n4) 600 ml double cream\n5) 3 tablespoons Drambuie",
            "exec": "1) Place the cranberries, raspberries, sugar and 3 tablespoons of the Drambuie in a saucepan. Bring to a simmer and cook for 10 minutes, or until the cranberries are very soft and breaking up. Leave to cool, then stir in the rest of the Drambuie to loosen.Lightly grease a baking sheet and a large loaf tin, then line the tin with clingfilm, leaving excess hanging over the sides.\n2) Toast the oats in a dry, non-stick pan for 5 minutes, or until golden, stirring often. Tip them onto a plate and leave to cool.\n3) Wipe the pan clean, add the caster sugar and very gently melt over a low heat, without stirring, for about 5 minutes, until molten. Once most of the sugar is liquid, gently swirl the pan to mix it into a smooth, golden caramel.\n4) Stir in the toasted oats, coating them in the caramel, then tip onto the baking tray and spread them out evenly. Leave to cool completely, then crush into small pieces, using a pestle and mortar or a food processor. You can make this a day or two ahead – just store in an airtight tin in a cool place until needed.\n5) For the cream, add the egg yolks to a large bowl and whisk in the sugar with an electric whisk, until very thick and creamy, for about 5 minutes.\n6) Bring the honey to the boil in a small pan over a medium heat, let it cool for 1 minute, then pour into the yolk mixture in a steady stream, whisking constantly. Very softly whip the cream and Drambuie together in a large bowl, then fold this into the egg mixture, followed by half of the crunchy oatmeal.\nSpoon a couple of tablespoons of the fruit compote into the base of the loaf tin, top with a third of the cream, then repeat the layers until you have used all the cream and fruit. Run the handle of a teaspoon through the mixture to ripple the fruit a little. Leave in the freezer overnight.\n7) Remove from the freezer 10 to 15 minutes before serving, to allow it to soften slightly, then cut into slices and serve with the rest of the crunchy oats scattered on top.",
            "img": "@drawable/id_20"
        },
        {
            "_id": "21",
            "basic_element": "Pineapple",
            "recipe_title": "Sage Honey Pineapple Blended Cocktail",
            "calories": "280",
            "date_added": "14/5/2021",
            "recipe_category": "Cocktail",
            "dif_rate": "3",
            "exec_time": "35",
            "special_d": "None",
            "_elements": "1) 1/2 cup honey, 1/2 cup water\n2) 5 sprigs fresh sage\n3) 4 cups frozen pineapple\n4) 2 ounces lime juice\n5) 1 1/2 cups ice",
            "exec": "Make the sage honey syrup:\n1) Add 1/2 cup honey and ½ cup water into a saucepan along with 5 springs of fresh sage.\n2) Heat on medium high heat until mixture comes to a bubble, then reduce to medium and allow to simmer for 15 minutes. Turn off heat and allow to cool for 30 minutes then discard the sage.\nMake the cocktail:\n1) Place the frozen pineapple, vodka, lime juice and 1/4 cup prepared honey syrup into the blender. \n2) Blend on smoothie setting and allow to run through cycle. Serve immediately and garnish with a toasted sage leaf.",
            "img": "@drawable/id_21"
        },
        {
            "_id": "22",
            "basic_element": "Chicken",
            "recipe_title": "Broiled Paprika and Lemon-Pepper Chicken Breasts",
            "calories": "220",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "2",
            "exec_time": "20",
            "special_d": "Dairy-free",
            "_elements": "1) 2½ tablespoons extra-virgin olive oil, divided, 2 skinless, boneless chicken breast halves\n2) 2 tablespoons paprika\n3) 1 tablespoon lemon-pepper seasoning\n4) 1 tablespoon kosher salt\n5) 2 cloves garlic, smashed and finely chopped\n6) ½ medium onion, chopped ",
            "exec": "1) Set an oven rack about 6 inches from the heat source and preheat the oven's broiler. Grease a broiler pan with 1/2 tablespoon olive oil.\n2) Rinse chicken breasts and pat dry. Brush with remaining olive oil until coated. Sprinkle each piece evenly on both sides with paprika, lemon-pepper, and salt. Place on the prepared broiler pan, sprinkle garlic over top, and sprinkle onions around the base of the chicken, with several smaller pieces on top.\n3) Cook under the preheated broiler for 5 minutes. Flip and continue to cook, checking often, until no longer pink in the center and the juices run clear, 5 to 10 more minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
            "img": "@drawable/id_22"
        },
        {
            "_id": "23",
            "basic_element": "Raspberry",
            "recipe_title": "Baked raspberry cheesecake",
            "calories": "623",
            "date_added": "15/3/2021",
            "recipe_category": "Desert",
            "dif_rate": "3",
            "exec_time": "60",
            "special_d": "Vegetarian",
            "_elements": "1) digestive biscuits 8\n2) butter 50g, meltedcream cheese 600g\n3) plain flour 2 tbsp\n4) golden caster sugar 175g\n5) vanilla extract\n6) eggs 2, plus 1 yolk\n7) soured cream 150ml potraspberries 300g punnet\n8) icing sugar",
            "exec": "1) Heat the oven to 180C/fan 160C/gas 4. Crush the biscuits in a food processor (or put in a plastic bag and bash with a rolling pin). Mix with the butter. Press into a 20cm spring-form tin and bake for 5 minutes, then cool.\n2) Beat the cream cheese with the flour, sugar, a few drops of vanilla, eggs, the yolk and soured cream until light and fluffy. Stir in half the raspberries and pour into the tin. Bake for 40 minutes and then check, it should be set but slightly wobbly in the centre. Leave in the tin to cool. Keep a few raspberries for the top and put the rest in a pan with 1 tbsp icing sugar. Heat until juicy and then squash with a fork. Push through a sieve. Serve the cheesecake with the raspberry sauce and raspberries.",
            "img": "@drawable/id_23"
        },
        {
            "_id": "24",
            "basic_element": "Beef",
            "recipe_title": "Easy Meatloaf",
            "calories": "372",
            "date_added": "15/3/2021",
            "recipe_category": "Lunch",
            "dif_rate": "2",
            "exec_time": "60",
            "special_d": "None",
            "_elements": "1) 1½ pounds ground beef\n2) 1 egg\n3) 1 onion, chopped\n4) 1 cup milk\n5) 1 cup dried bread crumbs\n6) salt and pepper to taste\n7) 2 tablespoons brown sugar\n8) 2 tablespoons prepared mustard\n9) ⅓ cup ketchup ",
            "exec": "1) Preheat oven to 350 degrees F (175 degrees C).\n1) In a large bowl, combine the beef, egg, onion, milk and bread OR cracker crumbs. Season with salt and pepper to taste and place in a lightly greased 9x5-inch loaf pan, or form into a loaf and place in a lightly greased 9x13-inch baking dish.\n3) In a separate small bowl, combine the brown sugar, mustard and ketchup. Mix well and pour over the meatloaf.\n4) Bake at 350 degrees F (175 degrees C) for 1 hour.",
            "img": "@drawable/id_24"
        },
        {
            "_id": "25",
            "basic_element": "Chorizo",
            "recipe_title": "Air Fryer Mini Breakfast Burritos",
            "calories": "254",
            "date_added": "15/4/2021",
            "recipe_category": "Breakfast",
            "dif_rate": "2",
            "exec_time": "10",
            "special_d": "None",
            "_elements": "1) ¼ cup Mexican-style chorizo\n2) 1 tablespoon bacon grease\n3) ½ cup diced potatoes\n4) 2 tablespoons chopped onion\n5) 1 serrano pepper, chopped\n6) 2 large eggs\n7) salt and ground black pepper to taste\r\n8) 4 (8 inch) flour tortillas\r\n9) avocado oil cooking spray ",
            "exec": "1) Cook chorizo in a large skillet over medium-high heat, stirring frequently, until sausage turns a dark red, 6 to 8 minutes. Remove from the skillet and set aside.\r\n2) Melt bacon grease in the same skillet over medium-high heat. Add diced potatoes and cook, stirring occasionally, 8 to 10 minutes. Add onion and serrano pepper and continue cooking and stirring until potatoes are fork-tender, onion is translucent, and serrano pepper is soft, 2 to 6 minutes. Add eggs and chorizo; stir until cooked and completely incorporated into potato mixture, about 5 minutes. Season with salt and pepper.\r\n3) Meanwhile, heat tortillas in a large skillet or directly on the grates of a gas stove until soft and pliable. Place 1/3 cup chorizo mixture down the center of each tortilla. Fold top and bottom of tortillas over the filling, then roll each into a burrito shape. Mist with cooking spray and place in the basket of an air fryer.\r\n4) Air fry at 400 degrees F (200 degrees C) for 4 to 6 minutes. Flip each burrito over, mist with cooking spray, and air fry until lightly browned, 2 to 4 minutes more.",
            "img": "@drawable/id_25"
        },
        {
            "_id": "26",
            "basic_element": "Black-eyed peas",
            "recipe_title": "Slow Cooker Spicy Black-Eyed Peas",
            "calories": "199",
            "date_added": "30/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "40",
            "special_d": "Dairy-free",
            "_elements": "1) 1 cube chicken bouillon\r\n2) 1 pound dried black-eyed peas, sorted and rinsed\r\n3) 1 onion, diced\r\n4) 2 cloves garlic, diced\r\n5) 1 red bell pepper, stemmed, seeded, and diced\r\n6) 1 jalapeno chile, seeded and minced\r\n7) 8 ounces diced ham\r\n8) 4 slices bacon, chopped\r\n9) ½ teaspoon cayenne pepper\r\n10) 1½ teaspoons cumin\r\n11) salt, to taste\r\n12) 1 teaspoon ground black pepper ",
            "exec": "1) Pour the water into a slow cooker, add the bouillon cube, and stir to dissolve. \n2) Combine the black-eyed peas, onion, garlic, bell pepper, jalapeno pepper, ham, bacon, cayenne pepper, cumin, salt, and pepper; stir to blend. Cover the slow cooker and cook on Low for 6 to 8 hours until the beans are tender.",
            "img": "@drawable/id_26"
        },
        {
            "_id": "27",
            "basic_element": "Chicken",
            "recipe_title": "Almond soup",
            "calories": "434",
            "date_added": "30/5/2021",
            "recipe_category": "Soups",
            "dif_rate": "2",
            "exec_time": "50",
            "special_d": "None",
            "_elements": "1) 225g/8oz blanched almonds\n2) minced \n3) 3 egg yolks \n4) hard-boiled  \n5) 1.2 litres/2pt chicken stock\n6) 25g/1oz \n7) butter \n8) softened \n9) 25g/1oz plain flour 125ml/4fl oz single cream salt \n10) freshly ground \n11) black pepper",
            "exec": "1)Using a mortar and pestle, reduce the almonds to a paste with the egg yolks and 1 tablespoon of the stock. Set aside. \n2) Make a beurre manie by working the butter and flour together into a smooth paste using a fork. Bring the remaining stock to a simmer in a heavy saucepan. Add the beurre manie in small knobs, whisking vigorously after each addition until completely dissolved. Whisk in the almond paste until smooth, then cook gently for 30 minutes. 3) Strain the soup through a sieve into a clean pan. Add the cream, and season with salt and pepper. Reheat gently and serve.",
            "img": "@drawable/id_27"
        },
        {
            "_id": "28",
            "basic_element": "Beef",
            "recipe_title": "Boston bean soup",
            "calories": "402",
            "date_added": "30/5/2021",
            "recipe_category": "Soups",
            "dif_rate": "1",
            "exec_time": "40",
            "special_d": "Dairy-free",
            "_elements": "1) 850g/13/4 lb canned cooked pinto beans \n2) drained 2 tomatoes \n3) chopped 1 celery stick \n4) sliced 1 medium onion \n5) chopped \n6) 1 bay leaf 450ml ¾ pt beef stock \n7) and freshly ground black pepper",
            "exec": "1)Put the beans, tomatoes, celery, onion, bay leaf and stock in a medium saucepan. Cover the pan, and bring the mixture to the boil over a medium-high heat. \n2) Reduce the heat and simmer for about 20 minutes until the vegetables are quite soft. Leave the soup to sit, uncovered, for a further 20 minutes. Remove the bay leaf.\n3)Puree half the soup in a blender or food processor. Mix into the remaining soup. Season to taste with salt and pepper, and serve.",
            "img": "@drawable/id_28"
        },
        {
            "_id": "29",
            "basic_element": "Carrot & coriander",
            "recipe_title": "Carrot & coriander soup",
            "calories": "348",
            "date_added": "5/1/21",
            "recipe_category": "Soups",
            "dif_rate": "2",
            "exec_time": "60",
            "special_d": "Vegetarian",
            "_elements": "1) 175g/6oz onion, diced \n2) 50g/2oz butter \n3) 500g/1lb 2oz carrots, sliced \n4) 1 garlic clove, finely chopped \n5) 1.2 litres/2pt vegetable stock \n6) 2 teaspoons caster sugar \n7) 150ml/5fl oz whipping cream \n8) 2 tablespoons chopped fresh \n9) coriander leaves \n10) salt and freshly ground black pepper",
            "exec": "1)In a heavy saucepan, gently sweat the onion in the butter until soft and translucent. Add the carrots to the pan, and cook, stirring from time to time, for a further 5 minutes. \n2)Add the garlic and stock. Season with salt and pepper and the sugar. Bring to the boil, reduce the heat and simmer for 30 minutes. \n3)Pour the contents of the pan into a blender or food processor, and blitz to a puree. Pour back into a clean pan, and add the cream and coriander. Taste and adjust the seasoning, then heat the soup through gently, stirring. Serve hot.",
            "img": "@drawable/id_29"
        },
        {
            "_id": "30",
            "basic_element": "Beef",
            "recipe_title": "Catalan soup",
            "calories": "325",
            "date_added": "5/5/21",
            "recipe_category": "Soups",
            "dif_rate": "2",
            "exec_time": "60",
            "special_d": "Dairy-free",
            "_elements": "1) 1 tablespoon vegetable oil \n2) 900g/2lb beef mince \n3) 2 carrots, chopped \n4) 2 onions, chopped \n5) 2 tomatoes \n6) chopped 25g/1oz plain flour \n7) 1.2 litres/2pt hot vegetable stock",
            "exec": "1)Heat the oil in a flameproof casserole dish over a medium heat. Saute the beef until it is just cooked, then remove and keep to one side. Saute the carrots, onions and tomatoes in the same pan for a few minutes, stirring continuously to prevent sticking. \n2)Blend in the flour using a wooden spoon, and cook for a few more minutes. Return the cooked mince to the casserole. \n3)Cover the mixture with the hotstock, and simmer the soup gently for about 45 minutes. Serve hot.",
            "img": "@drawable/id_30"
        },
        {
            "_id": "31",
            "basic_element": "Cauliflower",
            "recipe_title": "Cauliflower & walnut soup",
            "calories": "243",
            "date_added": "5/6/21",
            "recipe_category": "Soups",
            "dif_rate": "1",
            "exec_time": "45",
            "special_d": "Vegetarian",
            "_elements": "1) 1 medium cauliflower \n2) broken into florets \n3) 1 onion \n4) roughly chopped \n5) 450ml/3⁄4pt vegetable stock \n6) 450ml/3⁄4pt milk \n7) 25g/1oz walnut pieces salt \n8) freshly ground black pepper",
            "exec": "1)Put the cauliflower, onion and stock in a large heavy saucepan. Bring to the boil, cover and simmer for about 15 minutes until soft. \n2)Add the milk and walnuts, and stir through. Puree in a blender or food processor until smooth. \n3)Return the soup to the pan. Season to taste with salt and pepper, then bring to the boil – be careful not to scorch. Serve hot.",
            "img": "@drawable/id_31"
        },
        {
            "_id": "32",
            "basic_element": "Celery",
            "recipe_title": "Celery & Stilton soup",
            "calories": "398",
            "date_added": "5/7/21",
            "recipe_category": "Soups",
            "dif_rate": "2",
            "exec_time": "50",
            "special_d": "None",
            "_elements": "1) 4 celery sticks, finely chopped \n2) 1 onion, finely chopped \n3) 50g/2oz butter \n4) 45g/11⁄2oz plain flour \n5) 1/2 lass white wine \n6) 900ml/11⁄2pt chicken stock \n7) 300ml/10fl oz milk \n8) 225g/8oz crumbled Stilton \n9) cheese \n10) salt and freshly ground \n11) black pepper",
            "exec": "1)In a heavy saucepan over a lowheat, gently sweat the celery and onion in butter until soft. Add the flour and remove from the heat. \n2)Pour in the wine and stock, stirring continuously. Return to the heat and slowly bring to the boil, stirring until the mixture thickens. Simmer for 25 minutes. \n3)Add the milk, simmer for a further 2 minutes and remove from the heat. Whisk in the Stilton. \n4)Puree the soup in a blender or food processor, then push through a sieve into a clean pan. Season with salt and pepper. \n5)Reheat gently and serve.",
            "img": "@drawable/id_32"
        },
        {
            "_id": "33",
            "basic_element": "Chicken",
            "recipe_title": "Chicken soup",
            "calories": "487",
            "date_added": "5/8/21",
            "recipe_category": "Soups",
            "dif_rate": "2",
            "exec_time": "140",
            "special_d": "Dairy-free",
            "_elements": "1) 1 roast chicken carcass with meat \n2) 225g/8oz chicken wings \n3) 1 onion, diced \n4) 1 leek, diced \n5) 1 parsnip, diced \n6) 6 whole black peppercorns",
            "exec": "1)Preheat the oven to 150°C/300°F/ Gas mark 2. Put in a large heavy saucepan with the chicken wings. \n2)Add the onion, leek and parsnip, and bring to the boil. While the water is heating, add the whole peppercorns. \n3)Once the stock has boiled, transfer to an ovenproof dish and cook in the oven for 2 hours. Skim off any scum from the surface using a slotted spoon, and strain the stock you have created. Discard everything except for the chicken. \n4)When cool enough to handle, take out the carcass and shred the chicken before returning it to the stock. Serve hot.",
            "img": "@drawable/id_33"
        },
        {
            "_id": "34",
            "basic_element": "Chicken",
            "recipe_title": "Chicken noodle soup",
            "calories": "387",
            "date_added": "5/9/21",
            "recipe_category": "Soups",
            "dif_rate": "1",
            "exec_time": "20",
            "special_d": "None",
            "_elements": "1) 900ml/11⁄2pt chicken stock \n2) 1 bay leaf \n3) 4 spring onions \n4) sliced 225g/8oz button mushrooms \n5) Sliced 100g/4oz cooked skinless chicken breast \n6) thinly sliced 50g/2oz soup pasta such as orzo or ditalini \n7) 150ml/5fl oz dry white wine \n8) 1 tablespoon chopped fresh flat-leaf parsley salt \n9) ground black pepper",
            "exec": "1)Put the stock and bay leaf into a heavy pan, and bring to the boil. Add the spring onions and mushrooms to the simmering stock. \n2)Add the chicken to the soup, and season with salt and pepper. Heat through for 2–3 minutes. \n3)Add the pasta, cover and simmer for 7–8 minutes. \n4)Just before serving, add the wine and parsley, heat the soup through for 2–3 minutes, then check the seasoning and adjust if necessary. Serve hot.",
            "img": "@drawable/id_34"
        },
        {
            "_id": "35",
            "basic_element": "Chicken",
            "recipe_title": "Cock-a-leekie",
            "calories": "236",
            "date_added": "5/9/21",
            "recipe_category": "Soups",
            "dif_rate": "3",
            "exec_time": "40",
            "special_d": "Dairy-free",
            "_elements": "1) 450g/1lb prunes \n2) stoned 1.3kg/3lb boiling chicken \n3) 2.4 litres/4pt chicken stock \n4) 900g/2lb leeks \n5) well rinsed \n6) 1 bouquet garni salt \n7) ground black pepper",
            "exec": "1)Put the prunes in a bowl, cover with cold water and soak overnight. \n2)Set the chicken, breast-side down, in a large casserole dish. Pour in the stock and bring to the boil, skimming off any scum from the surface. \n3)Using string, tie half the leeks in a bundle; thinly slice the remainder. Add the bundle of leeks to the casserole dish with the bouquet garni and a pinch of salt. Reduce the heat, part-cover and simmer for 2 hours. \n4)Lift out the chicken and keep to one side to cool slightly. Remove and discard the bundle of leeks and bouquet garni. Drain the prunes, add them to the casserole dish and simmer for 20 minutes. \n5)Shred the meat from the cooled chicken, discarding any skin and bones, and add the meat to the soup. Season to taste with salt and pepper, then add the sliced leeks. Simmer for a further 10 minutes, then serve.",
            "img": "@drawable/id_35"
        },
        {
            "_id": "36",
            "basic_element": "Chicken",
            "recipe_title": "Hot & sour soup",
            "calories": "435",
            "date_added": "5/9/21",
            "recipe_category": "Soups",
            "dif_rate": "2",
            "exec_time": "30",
            "special_d": "None",
            "_elements": "1) 8 dried shiitake mushrooms \n2) 25g/1oz cornflour \n3) 3 tablespoons dry sherry \n4) 100g/4oz pork loin \n5) 1.2 litres/2pt chicken stock \n6) 50g/2oz bamboo shoots \n7) sliced 1 tablespoon light soy sauce \n8) 2 tablespoons red wine vinegar \n9) 1 egg lightly beaten \n10) 225g/8oz tofu \n11) diced salt \n12) freshly ground black pepper",
            "exec": "1)In a medium bowl, soak the mushrooms in warm water for 20 minutes, then drain, squeeze out any excess moisture and cut into 1cm/1⁄2in slices. \n2) In a small dish, stir the cornflour into the sherry and set aside. \n3) Put the pork loin in a large heavy pan and completely cover with water. Simmer until tender, then cool and shred. \n4) Bring the stock to the boil. Stir in the pork, mushrooms and bamboo shoots. Simmer for 10 minutes, then stir in the soy sauce and red wine vinegar. Season with salt and pepper, then stir in the reserved cornflour mixture. Keep stirring until the soup has thickened. \n5) Remove from the heat and whisk in the egg. Mix in the tofu and heat through. Serve the soup hot.",
            "img": "@drawable/id_36"
        },
        {
            "_id": "37",
            "basic_element": "Tomato",
            "recipe_title": "Gazpacho",
            "calories": "425",
            "date_added": "5/9/21",
            "recipe_category": "Soups",
            "dif_rate": "3",
            "exec_time": "25",
            "special_d": "Vegetarian",
            "_elements": "1) 2 large garlic cloves \n2) 1 egg yolk \n3) 1 thick slice bread, crust removed \n4) 90ml/3fl oz olive oil \n5) 450g/1lb canned whole peeled plum tomatoes \n6) 900g/2lb ripe tomatoes \n7) deseeded and chopped 1 large onion \n8) chopped 1 cucumber \n9) peeled \n10) chopped 2 red peppers, seeded and chopped \n11) 1 tablespoon tomato puree sea salt \n12) freshly ground black pepper \n13) 2 lemons, cut into wedges, to serve",
            "exec": "1) Put the garlic, egg yolk and bread in a blender or food processor. With the motor running, slowly add the oil in a thin steady stream until the mixture turns to mayonnaise. \n2) Add the chopped tomatoes, onion, cucumber, peppers and tomato puree in batches, and continue blending until smooth. \n3) Season with salt and pepper to taste, and chill in the refrigerator until ready to serve. \n4) Just before serving, check the seasoning and adjust if necessary. Serve cold with lemon wedges for squeezing over.",
            "img": "@drawable/id_37"
        },
        {
            "_id": "38",
            "basic_element": "Egg",
            "recipe_title": "Eggs with spinach",
            "calories": "552",
            "date_added": "13/5/2021",
            "recipe_category": "Eggs",
            "dif_rate": "1",
            "exec_time": "25",
            "special_d": "Vegetarian",
            "_elements": "1) 450g/1lb fresh spinach \n2) 25g/1oz butter \n3) 1 small onion \n4) finely chopped pinch of ground nutmeg \n5) 4 eggs \n6) salt and freshly ground black pepper",
            "exec": "1) Cook the spinach for 1–2 minutes in boiling water until the leaves have just wilted, then drain and squeeze out the excess water.\n2) In a heavy frying pan, melt the butter and sweat the onion for 5 minutes until soft.\n3) Add the spinach and cook for a further 5 minutes, stir in frequently.\n4) Season with a pinch of nutmeg and salt and pepper. Make four holes in the spinach, and break an egg into each space. \n5)Cover the pan and cook for 5 minutes until the egg whites are cooked through.\n6) Serve with bread.",
            "img": "@drawable/id_38"
        },
        {
            "_id": "39",
            "basic_element": "Cheese",
            "recipe_title": "Feta cheese & capers",
            "calories": "274",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "2",
            "exec_time": "30",
            "special_d": "Vegetarian",
            "_elements": "1) ½ teaspoon mixed peppercorns \n2) 8 coriander seeds \n3) 350g/12oz feta cheese, cubed \n4) 2 garlic cloves \n5) thinly sliced \n6) 1 bay leaf \n7) 1 tablespoon capers, rinsed \n drained 1 sprig of fresh oregano or thyme olive oil to cover 16 black olives hot toast",
            "exec": "1) Using a mortar and pestle, lightly crush the peppercorns and coriander seeds.\n2) In a screwtop glass jar, layer the feta cheese, garlic, bay leaf, ground peppercorns and coriander seeds, capers and a fresh sprig of thyme or oregano.\n3) Pour in enough oil to cover the cheese, and marinate for 2 weeks in the refrigerator.\n4) Serve the feta cheese on hot toast together with the black olives and a drizzling of oil.",
            "img": "@drawable/id_39"
        },
        {
            "_id": "40",
            "basic_element": "Egg",
            "recipe_title": "Chive omelette stir-fry",
            "calories": "393",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "30",
            "special_d": "Vegetarian",
            "_elements": "1) 2 eggs \n2) 2 tablespoons snipped fresh chives \n3) 1 tablespoon groundnut oil \n4) 1 garlic clove \n5) chopped 1cm/ 1/2 in piece of fresh root ginger \n6) chopped \n7) 2 celery sticks, cut into shreds \n8) 2 carrots, cut into shreds \n9) 2 small courgettes, cut into shreds \n10) 1 bunch of radishes \n11) sliced 4 spring onions, cut into shreds \n12) 100g/4oz beansprouts \n13) 1/4  head Chinese leaves, shredded \n14) 1 tablespoon sesame oil\n15) salt and freshly ground black pepper\r\n",
            "exec": "1) Whisk together the eggs and chives in a bowl. Season with salt and pepper, and whisk again.\n2) Heat about 1 teaspoon of the groundnut oil in a small frying pan, and pour in just enough of the egg mixture to cover the bottom of the pan.\n3) Cook for about 1 minute until set, then turn over and cook the omelette on the other side for a further minute.\n4) Tip out the omelette onto a plate, and cook the rest of the egg mixture in the same way to make two or three small omelettes, adding extra oil to the pan if necessary.\n5) Roll up each omelette and slice thinly.\n6) Keep the omelettes warm until required. Heat the remaining groundnut oil in a wok or large frying pan, add the garlic and ginger, and stir-fry for a few seconds.\n7) Add the celery, carrots and courgettes, and stir-fry for about 1 minute.\n8) Add the radishes, spring onions, beansprouts and Chinese leaves, and stir-fry for a further 3 minutes until all the vegetables are tender but still with a bite.\n9) Sprinkle the sesame oil over the vegetables, and toss gently.\n10) Serve the vegetables at once, with the omelette scattered over the top.",
            "img": "@drawable/id_40"
        },
        {
            "_id": "41",
            "basic_element": "Egg",
            "recipe_title": "French omelette",
            "calories": "267",
            "date_added": "3/2/21",
            "recipe_category": "Lunch",
            "dif_rate": "1",
            "exec_time": "20",
            "special_d": "Vegetarian",
            "_elements": "1) 6 eggs \n2) 50g/2oz butter \n3) salt \n4) freshly ground \n5) black pepper",
            "exec": "1) Place a medium frying pan over a medium heat. Whisk the eggs in a bowl with salt and pepper until frothy.\n2) Put half the butter in the pan, tilting the pan to coat, then add half the eggs. Using the flat of a fork, stir the center vigorously for 5 seconds, tilting the pan to move the uncooked egg to the edges. Remove from the pan while the middle is still slightly creamy, as the egg will continue cooking from residual heat.\n3) Repeat with the remaining butter and egg, and serve hot.",
            "img": "@drawable/id_41"
        },
        {
            "_id": "42",
            "basic_element": "Pasta",
            "recipe_title": "Seafood spaghetti",
            "calories": "498",
            "date_added": "4/6/21",
            "recipe_category": "Pasta",
            "dif_rate": "3",
            "exec_time": "35",
            "special_d": "None",
            "_elements": "1) 350g/12oz dried spaghetti \n2) 500g/1lb 2oz mussels \n3) 700g/11⁄2lb squid, cleaned \n4) 500g/1lb small littleneck clams \n5) 300g/11oz shrimps \n6) 4 cloves garlic \n7) 6 tablespoons extra virgin olive oil \n8) 250ml/9fl oz dry white wine \n9) 3 tablespoons chopped fresh \n10) flat-leaf parsley \n11) 2 dried red chillies, finely chopped \n12) salt and freshly ground black pepper",
            "exec": "1) Soak the mussels and clams in water for an hour.\n2) Discard any broken mussels or clams, or open ones that don’t close when tapped on the work surface. Under cold running water, scrub the mussels and clams thoroughly to remove any grit, pulling out the beards from the mussels.\n3) In a large deep frying pan over a medium heat, sweat 1 clove of the garlic in 2 tablespoons of the oil.\n4) Increase the heat to high, and add the mussels and clams with half of the wine.\n5) Cover with a tight-fitting lid, and cook for about 5 minutes until the shells are open (discard any that remain closed).\n6) Remove from the heat and discard the garlic.\n7) Slice the squid into rings and finely chop the remaining garlic.\n8) Heat the remaining oil in another pan, and saute the garlic, parsley and chillies for a few minutes. Add the squid and cook until the edges curl. Pour in the remaining wine and cover. Cook for 10 minutes. Add the shrimps (just the tails) and cook for a few more minutes before adding the clams and mussels.\n9) Simmer for another few minutes, then remove from the heat.\n10) Meanwhile, bring a large saucepan of salted water to the boil, add the spaghetti and cook until al dente.\n11) Drain and add the seafood mixture to the spaghetti, mixing well. Stir over a low heat for a couple of minutes. Serve piping hot.",
            "img": "@drawable/id_42"
        },
        {
            "_id": "43",
            "basic_element": "Tomato",
            "recipe_title": "Marinated tomato & rice salad",
            "calories": "336",
            "date_added": "18/3/2021",
            "recipe_category": "Salad",
            "dif_rate": "2",
            "exec_time": "20",
            "special_d": "Vegetarian",
            "_elements": "1)6 ripe tomatoes, diced \n2) 2 tablespoons chopped fresh basil \n3) 125ml/4fl oz cider vinegar \n4) 1 tablespoon granulated sugar \n5) 300g/11oz brown rice \n6) 2 cucumbers, halved lengthways, seeded and chopped \n7) 50g/2oz fresh flat-leaf parsley, chopped \n8) 125ml/4fl oz olive oil \n9) 9 spring onions, thinly sliced \n10) 1 teaspoon salt \n11) 1/2 teaspoon ground black pepper",
            "exec": "1) Put the tomatoes in a medium bowl. Add the vinegar, basil and sugar, and stir to mix well.\n2) Cover with cling film, and marinate in the refrigerator for 1 hour.\n3) Cook the rice according to the packet instructions.\n4) Drain and cool to room temperature.\n5) Combine the rice, cucumber and parsley in a large bowl, and stir in the olive oil.\n6) Add the spring onion, marinated tomatoes, salt and pepper, and stir to mix well. Serve.",
            "img": "@drawable/id_43"
        },
        {
            "_id": "44",
            "basic_element": "Pasta",
            "recipe_title": "Spaghetti Bolognese",
            "calories": "457",
            "date_added": "19/2/2021",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "60",
            "special_d": "None",
            "_elements": "1) 1 tablespoon olive oil \n2) 1 onion, finely chopped \n3) 2 garlic cloves, finely chopped \n4) 1 carrot, chopped \n5) 1 celery stick, chopped \n6) 50g/2oz streaky bacon, diced \n7) 350g/12oz minced beef \n8) 400g/14oz canned peeled \n9) plum tomatoes \n10) 2 teaspoons dried oregano \n11) 125ml/4fl oz red wine \n12) 2 tablespoons tomato puree \n13) salt and freshly ground black pepper \n14) 700g/ 1/2lb dried spaghetti",
            "exec": "1)Heat the oil in a large frying pan over a medium heat, then add the onion and sweat for 3 minutes.\n2) Add the garlic, carrot, celery and bacon, and saute for 3–4 minutes until just beginning to brown.\n3) Add the beef and cook over a high heat for another 3 minutes until all of the meat has browned.\n4) Stir in the tomatoes (breaking up slightly with a wooden spoon), oregano and wine, and bring to the boil.\n5) Reduce the heat and leave to simmer gently for at least 45 minutes. Stir in the tomato puree, and season with salt and pepper. Cook the spaghetti in a pan of lightly salted boiling water for 8–10 minutes until al dente. Drain thoroughly.\n6) Transfer the spaghetti to a large serving bowl, and pour the sauce over it.\n7) Toss to mix well, and serve hot.",
            "img": "@drawable/id_44"
        },
        {
            "_id": "45",
            "basic_element": "Pasta",
            "recipe_title": "Tuna & tomato noodles",
            "calories": "327",
            "date_added": "1/5/21",
            "recipe_category": "Lunch",
            "dif_rate": "1",
            "exec_time": "10",
            "special_d": "Dairy-free",
            "_elements": "1) 3 tablespoons olive oil \n2) 2 garlic cloves, finely chopped \n3) 2 dried red chillies, seeded and chopped \n4) 1 large red onion, finely sliced \n5) 175g/6oz canned tuna in oil, drained\n6) 100g/4oz pitted black olives \n7) 400g/14oz canned peeled plum tomatoes \n8) 2 tablespoons chopped fresh flat-leaf parsley \n9) 350g/12oz fresh egg noodles \n10) such as fettucine \n11) salt and freshly ground black pepper",
            "exec": "1) Heat the oil in a large frying pan.\n2) Add the garlic and dried chillies, saute for a few seconds, then add the onion. Saute, stirring, for about 5 minutes until the onion softens. Add the tuna and olives to the pan, and stir until well mixed. Stir in the tomatoes and any juices, and bring to the boil. Season with salt and pepper, add the parsley, then reduce the heat and simmer gently for about 5 minutes until the tomatoes have broken down. \n3) Meanwhile, cook the noodles in lightly salted boiling water for 3–4 minutes until just tender.\n5) Drain well, toss the noodles with the sauce and serve immediately.",
            "img": "@drawable/id_45"
        },
        {
            "_id": "46",
            "basic_element": "Pasta",
            "recipe_title": "Peppered chicken pasta",
            "calories": "301",
            "date_added": "14/5/2021",
            "recipe_category": "Lunch",
            "dif_rate": "2",
            "exec_time": "75",
            "special_d": "None",
            "_elements": "1) 700g/11⁄2lb skinless chicken breast fillet, cut into strips \n2) 2 teaspoons cracked black peppercorns \n3) 2 garlic cloves, minced \n4) 3 tablespoons olive oil \n5) 350g/12oz dried ribbon noodles such as fettucine \n6) 350ml/12fl oz chicken stock \n7) 1 tablespoon freshly squeezed lemon juice \n8) 75g/3oz Parmesan cheese \n9) freshly grated salt and freshly ground black pepper",
            "exec": "1) Toss the chicken with the peppercorns, garlic and 1 tablespoon of the oil.\n2) Cover and marinate in the refrigerator for at least 1 hour.\n3) Heat the remaining olive oil in a frying pan over a medium-high heat. Add the chicken and lightly brown all over for about 3 minutes.\n4) Add the stock and lemon juice, and reduce the heat to a simmer.\n5) Simmer the sauce for about 8 minutes. Season with salt and pepper.\n6) Meanwhile, cook the pasta in lightly salted boiling water until al dente.\n7) Drain well and toss with the chicken.\n8) Serve immediately, with the Parmesan in a separate bowl for sprinkling over the top.",
            "img": "@drawable/id_46"
        },
        {
            "_id": "47",
            "basic_element": "Pasta",
            "recipe_title": "Fig & chilli tagliatelle",
            "calories": "442",
            "date_added": "10/4/21",
            "recipe_category": "Lunch",
            "dif_rate": "3",
            "exec_time": "30",
            "special_d": "none",
            "_elements": "1) 350g/12oz egg tagliatelle \n2) 2 tablespoons extra virgin olive oil \n3) 8 black figs, each cut into 8 wedges \n4) 2 dried red chillies \n5) crumbled finely grated zest of 2 lemons and juice of 1 \n6) 125ml/4fl oz double cream \n7) 50g/2oz Parmesan cheese freshly grated \n8) salt and ground black pepper",
            "exec": "1) Bring a large pan of lightly salted water to the boil, and cook the tagliatelle until al dente. Drain. \n2) Meanwhile, heat a large frying pan, add the oil and, when smoking, carefully put the figs in the pan, turning them immediately to caramelize. Season with salt and pepper, and add the chilli.\n3) Stir the lemon zest and juice into the cream, and mix into the cooked pasta. Add the figs and serve hot, scattered with the Parmesan.",
            "img": "@drawable/id_47"
        },
        {
            "_id": "48",
            "basic_element": "Egg",
            "recipe_title": "Spanish omelette",
            "calories": "458",
            "date_added": "4/5/21",
            "recipe_category": "Lunch",
            "dif_rate": "1",
            "exec_time": "40",
            "special_d": "Vegetarian",
            "_elements": "1) 2 large potatoes, quartered \n2) 6 eggs \n3) 2 tablespoons olive oil \n4) 1 Spanish onion, chopped \n5) salt and freshly ground black pepper ",
            "exec": "1) Boil the potatoes in a saucepan of salted water for 15–20 minutes until just tender.\n2) Drain and leave until cool enough to handle, then cut the potatoes into slices. Beat the eggs in a bowl with salt and pepper to taste.\n3) Heat the oil in a deep non-stick frying pan over a low heat, add the onion and diced potatoes, and saute for 10–15 minutes, stirring frequently, until soft and golden.\n4) Preheat the grill to hot. Add the eggs to the frying pan, and cook undisturbed for 5 minutes or until the eggs are just beginning to set in the center.\n5) Slide the frying pan under the hot grill, and cook for a few minutes until the top is golden brown.\n6) Serve the omelette hot or cold, cut into wedges.",
            "img": "@drawable/id_48"
        },
        {
            "_id": "49",
            "basic_element": "Couscous",
            "recipe_title": "Couscous salad",
            "calories": "341",
            "date_added": "17/3/2021",
            "recipe_category": "Salad",
            "dif_rate": "2",
            "exec_time": "20",
            "special_d": "Vegetarian",
            "_elements": "1) 175g/6oz couscous \n2) 50g/2oz cooked peas \n3) Pinch of curry powder \n4) 2 spring onions (sliced) \n5) 1 small egg (hard-boiled andchopped) \n6) 2 tablespoons olive oil \n7) 2 teaspoons lemon juice \n8) Salt and pepper",
            "exec": "1) Cook the couscous according to the packet instructions.\n2) Mix the couscous with the peas, curry powder, spring onions and egg.\n3) Toss with the olive oil and lemon juice, and season well with salt and pepper.\n4) Serve.",
            "img": "@drawable/id_49"
        }
    ]
}